const areraLanLon = [
  {
    'name': '北京市',
    'shortName': '北京',
    'code': '11',
    'lat': 39.92998577808024,
    'lon': 116.39564503787867,
    'layer': 1,
    'subRegion': [
      {
        'name': '东城区',
        'shortName': '东城',
        'code': '0101',
        'lat': 39.93857401298612,
        'lon': 116.42188470126446,
        'layer': 2
      },
      {
        'name': '西城区',
        'shortName': '西城',
        'code': '0102',
        'lat': 39.93428014370851,
        'lon': 116.37319010401802,
        'layer': 2
      },
      {
        'name': '朝阳区',
        'shortName': '朝阳',
        'code': '0105',
        'lat': 39.95895316640668,
        'lon': 116.52169489108084,
        'layer': 2
      },
      {
        'name': '丰台区',
        'shortName': '丰台',
        'code': '0106',
        'lat': 39.84193785220474,
        'lon': 116.2583703354677,
        'layer': 2
      },
      {
        'name': '石景山区',
        'shortName': '石景山',
        'code': '0107',
        'lat': 39.93886654464553,
        'lon': 116.18455581036746,
        'layer': 2
      },
      {
        'name': '海淀区',
        'shortName': '海淀',
        'code': '0108',
        'lat': 40.03316204507791,
        'lon': 116.23967780102151,
        'layer': 2
      },
      {
        'name': '门头沟区',
        'shortName': '门头沟',
        'code': '0109',
        'lat': 40.000893031476494,
        'lon': 115.79579538125097,
        'layer': 2
      },
      {
        'name': '房山区',
        'shortName': '房山',
        'code': '0111',
        'lat': 39.72675262079634,
        'lon': 115.86283631290442,
        'layer': 2
      },
      {
        'name': '通州区',
        'shortName': '通州',
        'code': '0112',
        'lat': 39.80981488385131,
        'lon': 116.74007918067626,
        'layer': 2
      },
      {
        'name': '顺义区',
        'shortName': '顺义',
        'code': '0113',
        'lat': 40.154951470441354,
        'lon': 116.72822904528138,
        'layer': 2
      },
      {
        'name': '昌平区',
        'shortName': '昌平',
        'code': '0114',
        'lat': 40.2217235498323,
        'lon': 116.21645635689414,
        'layer': 2
      },
      {
        'name': '大兴区',
        'shortName': '大兴',
        'code': '0115',
        'lat': 39.652790118364464,
        'lon': 116.42519459737913,
        'layer': 2
      },
      {
        'name': '怀柔区',
        'shortName': '怀柔',
        'code': '0116',
        'lat': 40.63813934031092,
        'lon': 116.59340835643431,
        'layer': 2
      },
      {
        'name': '平谷区',
        'shortName': '平谷',
        'code': '0117',
        'lat': 40.21592545389569,
        'lon': 117.15043344819173,
        'layer': 2
      },
      {
        'name': '密云县',
        'shortName': '密云',
        'code': '0228',
        'lat': 40.532843361005,
        'lon': 117.00120053501465,
        'layer': 2
      },
      {
        'name': '延庆县',
        'shortName': '延庆',
        'code': '0229',
        'lat': 40.545156469742075,
        'lon': 116.16973528629558,
        'layer': 2
      }
    ]
  },
  {
    'name': '天津市',
    'shortName': '天津',
    'code': '12',
    'lat': 39.143929903310074,
    'lon': 117.21081309155257,
    'layer': 1,
    'subRegion': [
      {
        'name': '和平区',
        'shortName': '和平',
        'code': '0101',
        'lat': 39.12480884470283,
        'lon': 117.20281365402627,
        'layer': 2
      },
      {
        'name': '河东区',
        'shortName': '河东',
        'code': '0102',
        'lat': 39.12662568466626,
        'lon': 117.2616931652718,
        'layer': 2
      },
      {
        'name': '河西区',
        'shortName': '河西',
        'code': '0103',
        'lat': 39.08449373961522,
        'lon': 117.23616545061846,
        'layer': 2
      },
      {
        'name': '南开区',
        'shortName': '南开',
        'code': '0104',
        'lat': 39.11698728552219,
        'lon': 117.16272794945209,
        'layer': 2
      },
      {
        'name': '河北区',
        'shortName': '河北',
        'code': '0105',
        'lat': 39.17314893392419,
        'lon': 117.2202967650772,
        'layer': 2
      },
      {
        'name': '红桥区',
        'shortName': '红桥',
        'code': '0106',
        'lat': 39.17062133122504,
        'lon': 117.16221680791986,
        'layer': 2
      },
      {
        'name': '东丽区',
        'shortName': '东丽',
        'code': '0110',
        'lat': 39.13960464277469,
        'lon': 117.41478234324515,
        'layer': 2
      },
      {
        'name': '西青区',
        'shortName': '西青',
        'code': '0111',
        'lat': 39.03506461148468,
        'lon': 117.12620134664701,
        'layer': 2
      },
      {
        'name': '津南区',
        'shortName': '津南',
        'code': '0112',
        'lat': 38.96979053272527,
        'lon': 117.39290995971812,
        'layer': 2
      },
      {
        'name': '北辰区',
        'shortName': '北辰',
        'code': '0113',
        'lat': 39.25913062597893,
        'lon': 117.18060609828129,
        'layer': 2
      },
      {
        'name': '武清区',
        'shortName': '武清',
        'code': '0114',
        'lat': 39.457042575494015,
        'lon': 117.0345779137272,
        'layer': 2
      },
      {
        'name': '宝坻区',
        'shortName': '宝坻',
        'code': '0115',
        'lat': 39.61554400413299,
        'lon': 117.41142059078038,
        'layer': 2
      },
      {
        'name': '滨海新区',
        'shortName': '滨海',
        'code': '0116',
        'lat': 39.05917663803484,
        'lon': 117.64628627057449,
        'layer': 2
      },
      {
        'name': '宁河县',
        'shortName': '宁河',
        'code': '0221',
        'lat': 39.38156099601735,
        'lon': 117.68942402507139,
        'layer': 2
      },
      {
        'name': '静海县',
        'shortName': '静海',
        'code': '0223',
        'lat': 38.861262144345105,
        'lon': 116.97277226162211,
        'layer': 2
      },
      {
        'name': '蓟县',
        'shortName': '蓟县',
        'code': '0225',
        'lat': 40.00961366062446,
        'lon': 117.44115922145824,
        'layer': 2
      }
    ]
  },
  {
    'name': '河北省',
    'shortName': '河北',
    'code': '13',
    'lat': 38.61383974925108,
    'lon': 115.66143362422224,
    'layer': 1,
    'subRegion': [
      {
        'name': '石家庄市',
        'shortName': '石家庄',
        'code': '01',
        'lat': 38.048958314615454,
        'lon': 114.52208184420766,
        'layer': 2
      },
      {
        'name': '唐山市',
        'shortName': '唐山',
        'code': '02',
        'lat': 39.6505309225366,
        'lon': 118.18345059773411,
        'layer': 2
      },
      {
        'name': '秦皇岛市',
        'shortName': '秦皇岛',
        'code': '03',
        'lat': 39.945461565897574,
        'lon': 119.6043676161184,
        'layer': 2
      },
      {
        'name': '邯郸市',
        'shortName': '邯郸',
        'code': '04',
        'lat': 36.60930792847117,
        'lon': 114.4826939323422,
        'layer': 2
      },
      {
        'name': '邢台市',
        'shortName': '邢台',
        'code': '05',
        'lat': 37.069531196911996,
        'lon': 114.52048681294414,
        'layer': 2
      },
      {
        'name': '保定市',
        'shortName': '保定',
        'code': '06',
        'lat': 38.88656454802744,
        'lon': 115.49481016907626,
        'layer': 2
      },
      {
        'name': '张家口市',
        'shortName': '张家口',
        'code': '07',
        'lat': 40.81118849110306,
        'lon': 114.89378153032918,
        'layer': 2
      },
      {
        'name': '承德市',
        'shortName': '承德',
        'code': '08',
        'lat': 40.992521052457136,
        'lon': 117.93382245583847,
        'layer': 2
      },
      {
        'name': '沧州市',
        'shortName': '沧州',
        'code': '09',
        'lat': 38.297615350325714,
        'lon': 116.86380647644208,
        'layer': 2
      },
      {
        'name': '廊坊市',
        'shortName': '廊坊',
        'code': '10',
        'lat': 39.51861062508462,
        'lon': 116.70360222263986,
        'layer': 2
      },
      {
        'name': '衡水市',
        'shortName': '衡水',
        'code': '11',
        'lat': 37.74692904585666,
        'lon': 115.68622865290865,
        'layer': 2
      }
    ]
  },
  {
    'name': '山西省',
    'shortName': '山西',
    'code': '14',
    'lat': 37.86656599050925,
    'lon': 112.51549586383865,
    'layer': 1,
    'subRegion': [
      {
        'name': '太原市',
        'shortName': '太原',
        'code': '01',
        'lat': 37.89027705396754,
        'lon': 112.5508635890553,
        'layer': 2
      },
      {
        'name': '大同市',
        'shortName': '大同',
        'code': '02',
        'lat': 40.11374449970518,
        'lon': 113.29050867308048,
        'layer': 2
      },
      {
        'name': '阳泉市',
        'shortName': '阳泉',
        'code': '03',
        'lat': 37.86952949322259,
        'lon': 113.56923760163296,
        'layer': 2
      },
      {
        'name': '长治市',
        'shortName': '长治',
        'code': '04',
        'lat': 36.20166438574343,
        'lon': 113.12029208572514,
        'layer': 2
      },
      {
        'name': '晋城市',
        'shortName': '晋城',
        'code': '05',
        'lat': 35.49983446722556,
        'lon': 112.86733275750684,
        'layer': 2
      },
      {
        'name': '朔州市',
        'shortName': '朔州',
        'code': '06',
        'lat': 39.33767196622064,
        'lon': 112.47992772666272,
        'layer': 2
      },
      {
        'name': '晋中市',
        'shortName': '晋中',
        'code': '07',
        'lat': 37.69336152679759,
        'lon': 112.73851439991773,
        'layer': 2
      },
      {
        'name': '运城市',
        'shortName': '运城',
        'code': '08',
        'lat': 35.03885947981193,
        'lon': 111.00685365308033,
        'layer': 2
      },
      {
        'name': '忻州市',
        'shortName': '忻州',
        'code': '09',
        'lat': 38.46103057295889,
        'lon': 112.72793882880985,
        'layer': 2
      },
      {
        'name': '临汾市',
        'shortName': '临汾',
        'code': '10',
        'lat': 36.09974544358536,
        'lon': 111.53878759640808,
        'layer': 2
      },
      {
        'name': '吕梁市',
        'shortName': '吕梁',
        'code': '11',
        'lat': 37.52731609696258,
        'lon': 111.14315660234801,
        'layer': 2
      }
    ]
  },
  {
    'name': '内蒙古自治区',
    'shortName': '内蒙古',
    'code': '15',
    'lat': 43.46823822194904,
    'lon': 114.41586754816612,
    'layer': 1,
    'subRegion': [
      {
        'name': '呼和浩特市',
        'shortName': '呼和浩特',
        'code': '01',
        'lat': 40.828318873081585,
        'lon': 111.6603505200542,
        'layer': 2
      },
      {
        'name': '包头市',
        'shortName': '包头',
        'code': '02',
        'lat': 40.64711942570857,
        'lon': 109.84623853249181,
        'layer': 2
      },
      {
        'name': '乌海市',
        'shortName': '乌海',
        'code': '03',
        'lat': 39.683177006785236,
        'lon': 106.83199909716231,
        'layer': 2
      },
      {
        'name': '赤峰市',
        'shortName': '赤峰',
        'code': '04',
        'lat': 42.297112320317325,
        'lon': 118.9307611921676,
        'layer': 2
      },
      {
        'name': '通辽市',
        'shortName': '通辽',
        'code': '05',
        'lat': 43.633756072995986,
        'lon': 122.26036326322144,
        'layer': 2
      },
      {
        'name': '鄂尔多斯市',
        'shortName': '鄂尔多斯',
        'code': '06',
        'lat': 39.81648956060153,
        'lon': 109.99370625145134,
        'layer': 2
      },
      {
        'name': '呼伦贝尔市',
        'shortName': '呼伦贝尔',
        'code': '07',
        'lat': 49.201636054604336,
        'lon': 119.76082179399947,
        'layer': 2
      },
      {
        'name': '巴彦淖尔市',
        'shortName': '巴彦淖尔',
        'code': '08',
        'lat': 40.76917990242912,
        'lon': 107.42380671968002,
        'layer': 2
      },
      {
        'name': '乌兰察布市',
        'shortName': '乌兰察布',
        'code': '09',
        'lat': 41.02236294675116,
        'lon': 113.11284639067514,
        'layer': 2
      },
      {
        'name': '兴安盟',
        'shortName': '兴安',
        'code': '22',
        'lat': 46.08375706518232,
        'lon': 122.04816651406564,
        'layer': 2
      },
      {
        'name': '锡林郭勒盟',
        'shortName': '锡林郭勒',
        'code': '25',
        'lat': 43.93970484232425,
        'lon': 116.02733968895716,
        'layer': 2
      },
      {
        'name': '阿拉善盟',
        'shortName': '阿拉善',
        'code': '29',
        'lat': 38.84307526440767,
        'lon': 105.69568287112703,
        'layer': 2
      }
    ]
  },
  {
    'name': '辽宁省',
    'shortName': '辽宁',
    'code': '21',
    'lat': 41.62160010595761,
    'lon': 122.75359155771858,
    'layer': 1,
    'subRegion': [
      {
        'name': '沈阳市',
        'shortName': '沈阳',
        'code': '01',
        'lat': 41.808644783515746,
        'lon': 123.43279092160505,
        'layer': 2
      },
      {
        'name': '大连市',
        'shortName': '大连',
        'code': '02',
        'lat': 38.94870993830429,
        'lon': 121.59347778143518,
        'layer': 2
      },
      {
        'name': '鞍山市',
        'shortName': '鞍山',
        'code': '03',
        'lat': 41.118743682153465,
        'lon': 123.0077633288837,
        'layer': 2
      },
      {
        'name': '抚顺市',
        'shortName': '抚顺',
        'code': '04',
        'lat': 41.8773038295909,
        'lon': 123.92981976705381,
        'layer': 2
      },
      {
        'name': '本溪市',
        'shortName': '本溪',
        'code': '05',
        'lat': 41.32583762664885,
        'lon': 123.77806236979248,
        'layer': 2
      },
      {
        'name': '丹东市',
        'shortName': '丹东',
        'code': '06',
        'lat': 40.1290228266375,
        'lon': 124.33854311476908,
        'layer': 2
      },
      {
        'name': '锦州市',
        'shortName': '锦州',
        'code': '07',
        'lat': 41.13087887591732,
        'lon': 121.14774873823639,
        'layer': 2
      },
      {
        'name': '营口市',
        'shortName': '营口',
        'code': '08',
        'lat': 40.66865106647352,
        'lon': 122.23339137079269,
        'layer': 2
      },
      {
        'name': '阜新市',
        'shortName': '阜新',
        'code': '09',
        'lat': 42.01925010706022,
        'lon': 121.66082212856833,
        'layer': 2
      },
      {
        'name': '辽阳市',
        'shortName': '辽阳',
        'code': '10',
        'lat': 41.27333926556943,
        'lon': 123.17245120514733,
        'layer': 2
      },
      {
        'name': '盘锦市',
        'shortName': '盘锦',
        'code': '11',
        'lat': 41.14124802295616,
        'lon': 122.07322781023007,
        'layer': 2
      },
      {
        'name': '铁岭市',
        'shortName': '铁岭',
        'code': '12',
        'lat': 42.29975701212545,
        'lon': 123.85484961461594,
        'layer': 2
      },
      {
        'name': '朝阳市',
        'shortName': '朝阳',
        'code': '13',
        'lat': 41.57182766785653,
        'lon': 120.44616270273576,
        'layer': 2
      },
      {
        'name': '葫芦岛市',
        'shortName': '葫芦岛',
        'code': '14',
        'lat': 40.743029881317504,
        'lon': 120.86075764475588,
        'layer': 2
      }
    ]
  },
  {
    'name': '吉林省',
    'shortName': '吉林',
    'code': '22',
    'lat': 43.67884618524125,
    'lon': 126.26287593077805,
    'layer': 1,
    'subRegion': [
      {
        'name': '长春市',
        'shortName': '长春',
        'code': '01',
        'lat': 43.89833760709784,
        'lon': 125.31364242720072,
        'layer': 2
      },
      {
        'name': '吉林市',
        'shortName': '吉林',
        'code': '02',
        'lat': 43.87198833435933,
        'lon': 126.56454398883335,
        'layer': 2
      },
      {
        'name': '四平市',
        'shortName': '四平',
        'code': '03',
        'lat': 43.17552470112557,
        'lon': 124.39138207367984,
        'layer': 2
      },
      {
        'name': '辽源市',
        'shortName': '辽源',
        'code': '04',
        'lat': 42.923302619053665,
        'lon': 125.13368605218399,
        'layer': 2
      },
      {
        'name': '通化市',
        'shortName': '通化',
        'code': '05',
        'lat': 41.73639712986761,
        'lon': 125.94265013851434,
        'layer': 2
      },
      {
        'name': '白山市',
        'shortName': '白山',
        'code': '06',
        'lat': 41.94585939701795,
        'lon': 126.43579767534614,
        'layer': 2
      },
      {
        'name': '松原市',
        'shortName': '松原',
        'code': '07',
        'lat': 45.136048970084005,
        'lon': 124.83299453234117,
        'layer': 2
      },
      {
        'name': '白城市',
        'shortName': '白城',
        'code': '08',
        'lat': 45.621086275218886,
        'lon': 122.84077667910014,
        'layer': 2
      },
      {
        'name': '延边朝鲜族自治州',
        'shortName': '延边',
        'code': '24',
        'lat': 42.896413603744136,
        'lon': 129.4859019581615,
        'layer': 2
      }
    ]
  },
  {
    'name': '黑龙江省',
    'shortName': '黑龙江',
    'code': '23',
    'lat': 47.35659164311141,
    'lon': 128.0474137149926,
    'layer': 1,
    'subRegion': [
      {
        'name': '哈尔滨市',
        'shortName': '哈尔滨',
        'code': '01',
        'lat': 45.7732246332393,
        'lon': 126.65771685544611,
        'layer': 2
      },
      {
        'name': '齐齐哈尔市',
        'shortName': '齐齐哈尔',
        'code': '02',
        'lat': 47.34769981336638,
        'lon': 123.9872889421725,
        'layer': 2
      },
      {
        'name': '鸡西市',
        'shortName': '鸡西',
        'code': '03',
        'lat': 45.32153988655108,
        'lon': 130.94176727325066,
        'layer': 2
      },
      {
        'name': '鹤岗市',
        'shortName': '鹤岗',
        'code': '04',
        'lat': 47.33866590372683,
        'lon': 130.29247205063453,
        'layer': 2
      },
      {
        'name': '双鸭山市',
        'shortName': '双鸭山',
        'code': '05',
        'lat': 46.65510206248248,
        'lon': 131.1714017395816,
        'layer': 2
      },
      {
        'name': '大庆市',
        'shortName': '大庆',
        'code': '06',
        'lat': 46.596709020007594,
        'lon': 125.02183973021087,
        'layer': 2
      },
      {
        'name': '伊春市',
        'shortName': '伊春',
        'code': '07',
        'lat': 47.73468507507862,
        'lon': 128.91076597792159,
        'layer': 2
      },
      {
        'name': '佳木斯市',
        'shortName': '佳木斯',
        'code': '08',
        'lat': 46.813779604740354,
        'lon': 130.28473458595482,
        'layer': 2
      },
      {
        'name': '七台河市',
        'shortName': '七台河',
        'code': '09',
        'lat': 45.77500536864039,
        'lon': 131.0190480471218,
        'layer': 2
      },
      {
        'name': '牡丹江市',
        'shortName': '牡丹江',
        'code': '10',
        'lat': 44.58852115278252,
        'lon': 129.608035395637,
        'layer': 2
      },
      {
        'name': '黑河市',
        'shortName': '黑河',
        'code': '11',
        'lat': 50.250690090738274,
        'lon': 127.50083029523519,
        'layer': 2
      },
      {
        'name': '绥化市',
        'shortName': '绥化',
        'code': '12',
        'lat': 46.64606392699692,
        'lon': 126.98909457163498,
        'layer': 2
      },
      {
        'name': '大兴安岭地区',
        'shortName': '大兴安岭',
        'code': '27',
        'lat': 51.9917889680144,
        'lon': 124.19610419017351,
        'layer': 2
      }
    ]
  },
  {
    'name': '上海市',
    'shortName': '上海',
    'code': '31',
    'lat': 31.24916171001514,
    'lon': 121.48789948569473,
    'layer': 1,
    'subRegion': [
      {
        'name': '黄浦区',
        'shortName': '黄浦',
        'code': '0101',
        'lat': 31.227203440768868,
        'lon': 121.49607206403445,
        'layer': 2
      },
      {
        'name': '徐汇区',
        'shortName': '徐汇',
        'code': '0104',
        'lat': 31.169152089592195,
        'lon': 121.44623500472937,
        'layer': 2
      },
      {
        'name': '长宁区',
        'shortName': '长宁',
        'code': '0105',
        'lat': 31.213301496813617,
        'lon': 121.3876161086648,
        'layer': 2
      },
      {
        'name': '静安区',
        'shortName': '静安',
        'code': '0106',
        'lat': 31.23538080348789,
        'lon': 121.45475555700204,
        'layer': 2
      },
      {
        'name': '普陀区',
        'shortName': '普陀',
        'code': '0107',
        'lat': 31.263742929075534,
        'lon': 121.39844294374956,
        'layer': 2
      },
      {
        'name': '闸北区',
        'shortName': '闸北',
        'code': '0108',
        'lat': 31.288044465926138,
        'lon': 121.4577688102147,
        'layer': 2
      },
      {
        'name': '虹口区',
        'shortName': '虹口',
        'code': '0109',
        'lat': 31.28249722898657,
        'lon': 121.49191854079479,
        'layer': 2
      },
      {
        'name': '杨浦区',
        'shortName': '杨浦',
        'code': '0110',
        'lat': 31.304510479541904,
        'lon': 121.5357165996346,
        'layer': 2
      },
      {
        'name': '闵行区',
        'shortName': '闵行',
        'code': '0112',
        'lat': 31.093537540382123,
        'lon': 121.42502428093465,
        'layer': 2
      },
      {
        'name': '宝山区',
        'shortName': '宝山',
        'code': '0113',
        'lat': 31.398622694466777,
        'lon': 121.40904121844942,
        'layer': 2
      },
      {
        'name': '嘉定区',
        'shortName': '嘉定',
        'code': '0114',
        'lat': 31.36433805543363,
        'lon': 121.25101353755592,
        'layer': 2
      },
      {
        'name': '浦东新区',
        'shortName': '浦东',
        'code': '0115',
        'lat': 31.23089534913395,
        'lon': 121.6384813140922,
        'layer': 2
      },
      {
        'name': '金山区',
        'shortName': '金山',
        'code': '0116',
        'lat': 30.83508077708232,
        'lon': 121.24840817975154,
        'layer': 2
      },
      {
        'name': '松江区',
        'shortName': '松江',
        'code': '0117',
        'lat': 31.021244628098586,
        'lon': 121.22679050142115,
        'layer': 2
      },
      {
        'name': '青浦区',
        'shortName': '青浦',
        'code': '0118',
        'lat': 31.130862397996967,
        'lon': 121.09142524282201,
        'layer': 2
      },
      {
        'name': '奉贤区',
        'shortName': '奉贤',
        'code': '0120',
        'lat': 30.915122452605868,
        'lon': 121.56064167963345,
        'layer': 2
      },
      {
        'name': '崇明县',
        'shortName': '崇明',
        'code': '0230',
        'lat': 31.633564930802045,
        'lon': 121.5353975435439,
        'layer': 2
      }
    ]
  },
  {
    'name': '江苏省',
    'shortName': '江苏',
    'code': '32',
    'lat': 33.01379716995394,
    'lon': 119.36848893835847,
    'layer': 1,
    'subRegion': [
      {
        'name': '南京市',
        'shortName': '南京',
        'code': '01',
        'lat': 32.05723550180587,
        'lon': 118.77807440802562,
        'layer': 2
      },
      {
        'name': '无锡市',
        'shortName': '无锡',
        'code': '02',
        'lat': 31.57003745192303,
        'lon': 120.30545590053595,
        'layer': 2
      },
      {
        'name': '徐州市',
        'shortName': '徐州',
        'code': '03',
        'lat': 34.27155343109188,
        'lon': 117.18810662317686,
        'layer': 2
      },
      {
        'name': '常州市',
        'shortName': '常州',
        'code': '04',
        'lat': 31.771396744684242,
        'lon': 119.98186101345706,
        'layer': 2
      },
      {
        'name': '苏州市',
        'shortName': '苏州',
        'code': '05',
        'lat': 31.317987367952437,
        'lon': 120.61990711548988,
        'layer': 2
      },
      {
        'name': '南通市',
        'shortName': '南通',
        'code': '06',
        'lat': 32.014664540823446,
        'lon': 120.87380095093022,
        'layer': 2
      },
      {
        'name': '连云港市',
        'shortName': '连云港',
        'code': '07',
        'lat': 34.60154896700999,
        'lon': 119.17387221741889,
        'layer': 2
      },
      {
        'name': '淮安市',
        'shortName': '淮安',
        'code': '08',
        'lat': 33.606512739276326,
        'lon': 119.03018636465636,
        'layer': 2
      },
      {
        'name': '盐城市',
        'shortName': '盐城',
        'code': '09',
        'lat': 33.379861877120995,
        'lon': 120.14887181793894,
        'layer': 2
      },
      {
        'name': '扬州市',
        'shortName': '扬州',
        'code': '10',
        'lat': 32.40850525456844,
        'lon': 119.42777755116975,
        'layer': 2
      },
      {
        'name': '镇江市',
        'shortName': '镇江',
        'code': '11',
        'lat': 32.20440944359928,
        'lon': 119.45583540512952,
        'layer': 2
      },
      {
        'name': '泰州市',
        'shortName': '泰州',
        'code': '12',
        'lat': 32.47605327483028,
        'lon': 119.91960601619071,
        'layer': 2
      },
      {
        'name': '宿迁市',
        'shortName': '宿迁',
        'code': '13',
        'lat': 33.95204973370865,
        'lon': 118.29689337855334,
        'layer': 2
      }
    ]
  },
  {
    'name': '浙江省',
    'shortName': '浙江',
    'code': '33',
    'lat': 29.159494120760925,
    'lon': 119.95720242066378,
    'layer': 1,
    'subRegion': [
      {
        'name': '杭州市',
        'shortName': '杭州',
        'code': '01',
        'lat': 30.259244461536102,
        'lon': 120.2193754157201,
        'layer': 2
      },
      {
        'name': '宁波市',
        'shortName': '宁波',
        'code': '02',
        'lat': 29.885258965918055,
        'lon': 121.57900597258933,
        'layer': 2
      },
      {
        'name': '温州市',
        'shortName': '温州',
        'code': '03',
        'lat': 28.002837594041246,
        'lon': 120.6906347337091,
        'layer': 2
      },
      {
        'name': '嘉兴市',
        'shortName': '嘉兴',
        'code': '04',
        'lat': 30.77399223958183,
        'lon': 120.76042769895746,
        'layer': 2
      },
      {
        'name': '湖州市',
        'shortName': '湖州',
        'code': '05',
        'lat': 30.877925155690896,
        'lon': 120.13724316328172,
        'layer': 2
      },
      {
        'name': '绍兴市',
        'shortName': '绍兴',
        'code': '06',
        'lat': 30.00236458052847,
        'lon': 120.59246738555154,
        'layer': 2
      },
      {
        'name': '金华市',
        'shortName': '金华',
        'code': '07',
        'lat': 29.10289910539069,
        'lon': 119.65257570368145,
        'layer': 2
      },
      {
        'name': '衢州市',
        'shortName': '衢州',
        'code': '08',
        'lat': 28.95691044753569,
        'lon': 118.87584165150854,
        'layer': 2
      },
      {
        'name': '舟山市',
        'shortName': '舟山',
        'code': '09',
        'lat': 30.036010302553937,
        'lon': 122.1698720983516,
        'layer': 2
      },
      {
        'name': '台州市',
        'shortName': '台州',
        'code': '10',
        'lat': 28.668283285674367,
        'lon': 121.44061293593727,
        'layer': 2
      },
      {
        'name': '丽水市',
        'shortName': '丽水',
        'code': '11',
        'lat': 28.4562995521443,
        'lon': 119.92957584318849,
        'layer': 2
      }
    ]
  },
  {
    'name': '安徽省',
    'shortName': '安徽',
    'code': '34',
    'lat': 31.85925241707919,
    'lon': 117.2160052075697,
    'layer': 1,
    'subRegion': [
      {
        'name': '合肥市',
        'shortName': '合肥',
        'code': '01',
        'lat': 31.86694226068694,
        'lon': 117.28269909168304,
        'layer': 2
      },
      {
        'name': '芜湖市',
        'shortName': '芜湖',
        'code': '02',
        'lat': 31.36601978754301,
        'lon': 118.38410842322828,
        'layer': 2
      },
      {
        'name': '蚌埠市',
        'shortName': '蚌埠',
        'code': '03',
        'lat': 32.92949890669797,
        'lon': 117.35707986587582,
        'layer': 2
      },
      {
        'name': '淮南市',
        'shortName': '淮南',
        'code': '04',
        'lat': 32.64281182374795,
        'lon': 117.01863886329463,
        'layer': 2
      },
      {
        'name': '马鞍山市',
        'shortName': '马鞍山',
        'code': '05',
        'lat': 31.688528158880025,
        'lon': 118.515881846623,
        'layer': 2
      },
      {
        'name': '淮北市',
        'shortName': '淮北',
        'code': '06',
        'lat': 33.96002330536412,
        'lon': 116.79144742863005,
        'layer': 2
      },
      {
        'name': '铜陵市',
        'shortName': '铜陵',
        'code': '07',
        'lat': 30.940929694665662,
        'lon': 117.81942872880637,
        'layer': 2
      },
      {
        'name': '安庆市',
        'shortName': '安庆',
        'code': '08',
        'lat': 30.537897817381097,
        'lon': 117.0587387721073,
        'layer': 2
      },
      {
        'name': '黄山市',
        'shortName': '黄山',
        'code': '10',
        'lat': 29.73443485616307,
        'lon': 118.29356963200213,
        'layer': 2
      },
      {
        'name': '滁州市',
        'shortName': '滁州',
        'code': '11',
        'lat': 32.31735059538377,
        'lon': 118.32457035097686,
        'layer': 2
      },
      {
        'name': '阜阳市',
        'shortName': '阜阳',
        'code': '12',
        'lat': 32.90121133056961,
        'lon': 115.82093225904637,
        'layer': 2
      },
      {
        'name': '宿州市',
        'shortName': '宿州',
        'code': '13',
        'lat': 33.63677238578078,
        'lon': 116.9886924118307,
        'layer': 2
      },
      {
        'name': '六安市',
        'shortName': '六安',
        'code': '15',
        'lat': 31.75555835519844,
        'lon': 116.50525268298414,
        'layer': 2
      },
      {
        'name': '亳州市',
        'shortName': '亳州',
        'code': '16',
        'lat': 33.87121056530193,
        'lon': 115.78792824511814,
        'layer': 2
      },
      {
        'name': '池州市',
        'shortName': '池州',
        'code': '17',
        'lat': 30.660019248160626,
        'lon': 117.49447677159357,
        'layer': 2
      },
      {
        'name': '宣城市',
        'shortName': '宣城',
        'code': '18',
        'lat': 30.951642354295757,
        'lon': 118.75209631098257,
        'layer': 2
      }
    ]
  },
  {
    'name': '福建省',
    'shortName': '福建',
    'code': '35',
    'lat': 26.050118295660656,
    'lon': 117.98494311990738,
    'layer': 1,
    'subRegion': [
      {
        'name': '福州市',
        'shortName': '福州',
        'code': '01',
        'lat': 26.04712549657293,
        'lon': 119.33022110712668,
        'layer': 2
      },
      {
        'name': '厦门市',
        'shortName': '厦门',
        'code': '02',
        'lat': 24.489230612469232,
        'lon': 118.10388604566381,
        'layer': 2
      },
      {
        'name': '莆田市',
        'shortName': '莆田',
        'code': '03',
        'lat': 25.448450136734262,
        'lon': 119.07773096395962,
        'layer': 2
      },
      {
        'name': '三明市',
        'shortName': '三明',
        'code': '04',
        'lat': 26.270835279362192,
        'lon': 117.64219393404412,
        'layer': 2
      },
      {
        'name': '泉州市',
        'shortName': '泉州',
        'code': '05',
        'lat': 24.901652383991102,
        'lon': 118.60036234322938,
        'layer': 2
      },
      {
        'name': '漳州市',
        'shortName': '漳州',
        'code': '06',
        'lat': 24.517064779808482,
        'lon': 117.67620467894616,
        'layer': 2
      },
      {
        'name': '南平市',
        'shortName': '南平',
        'code': '07',
        'lat': 26.643626474197838,
        'lon': 118.18188294866125,
        'layer': 2
      },
      {
        'name': '龙岩市',
        'shortName': '龙岩',
        'code': '08',
        'lat': 25.07868543351518,
        'lon': 117.01799673877318,
        'layer': 2
      },
      {
        'name': '宁德市',
        'shortName': '宁德',
        'code': '09',
        'lat': 26.656527419158913,
        'lon': 119.54208214971854,
        'layer': 2
      }
    ]
  },
  {
    'name': '江西省',
    'shortName': '江西',
    'code': '36',
    'lat': 27.757258443440836,
    'lon': 115.67608236670434,
    'layer': 1,
    'subRegion': [
      {
        'name': '南昌市',
        'shortName': '南昌',
        'code': '01',
        'lat': 28.689578000141147,
        'lon': 115.89352754583604,
        'layer': 2
      },
      {
        'name': '景德镇市',
        'shortName': '景德镇',
        'code': '02',
        'lat': 29.303562768448288,
        'lon': 117.18652262527252,
        'layer': 2
      },
      {
        'name': '萍乡市',
        'shortName': '萍乡',
        'code': '03',
        'lat': 27.639544222952306,
        'lon': 113.85991703300718,
        'layer': 2
      },
      {
        'name': '九江市',
        'shortName': '九江',
        'code': '04',
        'lat': 29.71963952612237,
        'lon': 115.99984802155373,
        'layer': 2
      },
      {
        'name': '新余市',
        'shortName': '新余',
        'code': '05',
        'lat': 27.82232155862896,
        'lon': 114.9471174167892,
        'layer': 2
      },
      {
        'name': '鹰潭市',
        'shortName': '鹰潭',
        'code': '06',
        'lat': 28.241309597181967,
        'lon': 117.03545018601243,
        'layer': 2
      },
      {
        'name': '赣州市',
        'shortName': '赣州',
        'code': '07',
        'lat': 25.84529553634676,
        'lon': 114.9359090792838,
        'layer': 2
      },
      {
        'name': '吉安市',
        'shortName': '吉安',
        'code': '08',
        'lat': 27.113847650157084,
        'lon': 114.99203871092017,
        'layer': 2
      },
      {
        'name': '宜春市',
        'shortName': '宜春',
        'code': '09',
        'lat': 27.811129895842885,
        'lon': 114.40003867155777,
        'layer': 2
      },
      {
        'name': '抚州市',
        'shortName': '抚州',
        'code': '10',
        'lat': 27.954545170269935,
        'lon': 116.36091886693136,
        'layer': 2
      },
      {
        'name': '上饶市',
        'shortName': '上饶',
        'code': '11',
        'lat': 28.457622553937274,
        'lon': 117.95546387714894,
        'layer': 2
      }
    ]
  },
  {
    'name': '山东省',
    'shortName': '山东',
    'code': '37',
    'lat': 36.09928992972826,
    'lon': 118.52766339287801,
    'layer': 1,
    'subRegion': [
      {
        'name': '济南市',
        'shortName': '济南',
        'code': '01',
        'lat': 36.68278472716141,
        'lon': 117.02496706629023,
        'layer': 2
      },
      {
        'name': '青岛市',
        'shortName': '青岛',
        'code': '02',
        'lat': 36.10521490127382,
        'lon': 120.38442818368189,
        'layer': 2
      },
      {
        'name': '淄博市',
        'shortName': '淄博',
        'code': '03',
        'lat': 36.80468485421204,
        'lon': 118.05913427786938,
        'layer': 2
      },
      {
        'name': '枣庄市',
        'shortName': '枣庄',
        'code': '04',
        'lat': 34.80788307838604,
        'lon': 117.27930538329689,
        'layer': 2
      },
      {
        'name': '东营市',
        'shortName': '东营',
        'code': '05',
        'lat': 37.48712115527602,
        'lon': 118.58392633307061,
        'layer': 2
      },
      {
        'name': '烟台市',
        'shortName': '烟台',
        'code': '06',
        'lat': 37.53656156285964,
        'lon': 121.30955503008511,
        'layer': 2
      },
      {
        'name': '潍坊市',
        'shortName': '潍坊',
        'code': '07',
        'lat': 36.71611487305138,
        'lon': 119.14263382297052,
        'layer': 2
      },
      {
        'name': '济宁市',
        'shortName': '济宁',
        'code': '08',
        'lat': 35.40212166433135,
        'lon': 116.60079762482256,
        'layer': 2
      },
      {
        'name': '泰安市',
        'shortName': '泰安',
        'code': '09',
        'lat': 36.18807775894815,
        'lon': 117.08941491713698,
        'layer': 2
      },
      {
        'name': '威海市',
        'shortName': '威海',
        'code': '10',
        'lat': 37.52878708125143,
        'lon': 122.09395836580605,
        'layer': 2
      },
      {
        'name': '日照市',
        'shortName': '日照',
        'code': '11',
        'lat': 35.42022519314436,
        'lon': 119.50717994299387,
        'layer': 2
      },
      {
        'name': '莱芜市',
        'shortName': '莱芜',
        'code': '12',
        'lat': 36.23365413364694,
        'lon': 117.68466691247161,
        'layer': 2
      },
      {
        'name': '临沂市',
        'shortName': '临沂',
        'code': '13',
        'lat': 35.07240907439113,
        'lon': 118.34076823661057,
        'layer': 2
      },
      {
        'name': '德州市',
        'shortName': '德州',
        'code': '14',
        'lat': 37.46082592630501,
        'lon': 116.32816136356094,
        'layer': 2
      },
      {
        'name': '聊城市',
        'shortName': '聊城',
        'code': '15',
        'lat': 36.455828514727976,
        'lon': 115.98686913929107,
        'layer': 2
      },
      {
        'name': '滨州市',
        'shortName': '滨州',
        'code': '16',
        'lat': 37.405313941825895,
        'lon': 117.96829241452845,
        'layer': 2
      },
      {
        'name': '菏泽市',
        'shortName': '菏泽',
        'code': '17',
        'lat': 35.26244049607468,
        'lon': 115.46335977452752,
        'layer': 2
      }
    ]
  },
  {
    'name': '河南省',
    'shortName': '河南',
    'code': '41',
    'lat': 34.157183767956035,
    'lon': 113.48680405752653,
    'layer': 1,
    'subRegion': [
      {
        'name': '郑州市',
        'shortName': '郑州',
        'code': '01',
        'lat': 34.756610064140254,
        'lon': 113.64964384986449,
        'layer': 2
      },
      {
        'name': '开封市',
        'shortName': '开封',
        'code': '02',
        'lat': 34.80185417583674,
        'lon': 114.35164211776365,
        'layer': 2
      },
      {
        'name': '洛阳市',
        'shortName': '洛阳',
        'code': '03',
        'lat': 34.65736781765111,
        'lon': 112.44752476895121,
        'layer': 2
      },
      {
        'name': '平顶山市',
        'shortName': '平顶山',
        'code': '04',
        'lat': 33.74530145652439,
        'lon': 113.30084897797529,
        'layer': 2
      },
      {
        'name': '安阳市',
        'shortName': '安阳',
        'code': '05',
        'lat': 36.1102667221811,
        'lon': 114.35180650767198,
        'layer': 2
      },
      {
        'name': '鹤壁市',
        'shortName': '鹤壁',
        'code': '06',
        'lat': 35.75542587422399,
        'lon': 114.29776983802476,
        'layer': 2
      },
      {
        'name': '新乡市',
        'shortName': '新乡',
        'code': '07',
        'lat': 35.3072575576613,
        'lon': 113.91269016082377,
        'layer': 2
      },
      {
        'name': '焦作市',
        'shortName': '焦作',
        'code': '08',
        'lat': 35.234607554985935,
        'lon': 113.21183588499157,
        'layer': 2
      },
      {
        'name': '濮阳市',
        'shortName': '濮阳',
        'code': '09',
        'lat': 35.75329788820758,
        'lon': 115.02662744067226,
        'layer': 2
      },
      {
        'name': '许昌市',
        'shortName': '许昌',
        'code': '10',
        'lat': 34.026739588655204,
        'lon': 113.8353124597886,
        'layer': 2
      },
      {
        'name': '漯河市',
        'shortName': '漯河',
        'code': '11',
        'lat': 33.57627868848315,
        'lon': 114.04606140022909,
        'layer': 2
      },
      {
        'name': '三门峡市',
        'shortName': '三门峡',
        'code': '12',
        'lat': 34.783319941049726,
        'lon': 111.1812620932674,
        'layer': 2
      },
      {
        'name': '南阳市',
        'shortName': '南阳',
        'code': '13',
        'lat': 33.0114195691165,
        'lon': 112.5428419005123,
        'layer': 2
      },
      {
        'name': '商丘市',
        'shortName': '商丘',
        'code': '14',
        'lat': 34.43858864024636,
        'lon': 115.64188568785016,
        'layer': 2
      },
      {
        'name': '信阳市',
        'shortName': '信阳',
        'code': '15',
        'lat': 32.128582307511664,
        'lon': 114.0854909934702,
        'layer': 2
      },
      {
        'name': '周口市',
        'shortName': '周口',
        'code': '16',
        'lat': 33.62374081814082,
        'lon': 114.65410194229541,
        'layer': 2
      },
      {
        'name': '驻马店市',
        'shortName': '驻马店',
        'code': '17',
        'lat': 32.98315815409348,
        'lon': 114.04915354745555,
        'layer': 2
      },
      {
        'name': '济源市',
        'shortName': '济源',
        'code': '9001',
        'lat': 35.1053645624791,
        'lon': 112.40526796972516,
        'layer': 2
      }
    ]
  },
  {
    'name': '湖北省',
    'shortName': '湖北',
    'code': '42',
    'lat': 31.209316250139747,
    'lon': 112.41056219213213,
    'layer': 1,
    'subRegion': [
      {
        'name': '武汉市',
        'shortName': '武汉',
        'code': '01',
        'lat': 30.58108412692075,
        'lon': 114.31620010268132,
        'layer': 2
      },
      {
        'name': '黄石市',
        'shortName': '黄石',
        'code': '02',
        'lat': 30.21612712771406,
        'lon': 115.05068316392396,
        'layer': 2
      },
      {
        'name': '十堰市',
        'shortName': '十堰',
        'code': '03',
        'lat': 32.636994339468124,
        'lon': 110.80122891676038,
        'layer': 2
      },
      {
        'name': '宜昌市',
        'shortName': '宜昌',
        'code': '05',
        'lat': 30.73275781802591,
        'lon': 111.31098109196083,
        'layer': 2
      },
      {
        'name': '襄阳市',
        'shortName': '襄阳',
        'code': '06',
        'lat': 32.22916859153757,
        'lon': 112.25009284837394,
        'layer': 2
      },
      {
        'name': '鄂州市',
        'shortName': '鄂州',
        'code': '07',
        'lat': 30.384439322752247,
        'lon': 114.89559404135665,
        'layer': 2
      },
      {
        'name': '荆门市',
        'shortName': '荆门',
        'code': '08',
        'lat': 31.04261120294864,
        'lon': 112.21733029896677,
        'layer': 2
      },
      {
        'name': '孝感市',
        'shortName': '孝感',
        'code': '09',
        'lat': 30.927954784200963,
        'lon': 113.93573439207124,
        'layer': 2
      },
      {
        'name': '荆州市',
        'shortName': '荆州',
        'code': '10',
        'lat': 30.33259052298605,
        'lon': 112.24186580719135,
        'layer': 2
      },
      {
        'name': '黄冈市',
        'shortName': '黄冈',
        'code': '11',
        'lat': 30.446108937901133,
        'lon': 114.9066180465751,
        'layer': 2
      },
      {
        'name': '咸宁市',
        'shortName': '咸宁',
        'code': '12',
        'lat': 29.88065675772815,
        'lon': 114.30006059206065,
        'layer': 2
      },
      {
        'name': '随州市',
        'shortName': '随州',
        'code': '13',
        'lat': 31.717857608188574,
        'lon': 113.37935836429192,
        'layer': 2
      },
      {
        'name': '恩施土家族苗族自治州',
        'shortName': '恩施',
        'code': '28',
        'lat': 30.285888316555603,
        'lon': 109.49192330375213,
        'layer': 2
      },
      {
        'name': '仙桃市',
        'shortName': '仙桃',
        'code': '9004',
        'lat': 30.293966004922325,
        'lon': 113.38744819357841,
        'layer': 2
      },
      {
        'name': '潜江市',
        'shortName': '潜江',
        'code': '9005',
        'lat': 30.34311579260133,
        'lon': 112.76876801685833,
        'layer': 2
      },
      {
        'name': '天门市',
        'shortName': '天门',
        'code': '9006',
        'lat': 30.649047356422365,
        'lon': 113.12623048764767,
        'layer': 2
      },
      {
        'name': '神农架林区',
        'shortName': '神农架林',
        'code': '9021',
        'lat': 31.59576759908257,
        'lon': 110.48723070015252,
        'layer': 2
      }
    ]
  },
  {
    'name': '湖南省',
    'shortName': '湖南',
    'code': '43',
    'lat': 27.695864052356377,
    'lon': 111.720663546476,
    'layer': 1,
    'subRegion': [
      {
        'name': '长沙市',
        'shortName': '长沙',
        'code': '01',
        'lat': 28.21347823085322,
        'lon': 112.9793527876505,
        'layer': 2
      },
      {
        'name': '株洲市',
        'shortName': '株洲',
        'code': '02',
        'lat': 27.82743292766265,
        'lon': 113.13169534107074,
        'layer': 2
      },
      {
        'name': '湘潭市',
        'shortName': '湘潭',
        'code': '03',
        'lat': 27.83509505297878,
        'lon': 112.93555563303435,
        'layer': 2
      },
      {
        'name': '衡阳市',
        'shortName': '衡阳',
        'code': '04',
        'lat': 26.89816441535812,
        'lon': 112.58381881071617,
        'layer': 2
      },
      {
        'name': '邵阳市',
        'shortName': '邵阳',
        'code': '05',
        'lat': 27.236811244922414,
        'lon': 111.46152540355403,
        'layer': 2
      },
      {
        'name': '岳阳市',
        'shortName': '岳阳',
        'code': '06',
        'lat': 29.378007075474304,
        'lon': 113.14619551911636,
        'layer': 2
      },
      {
        'name': '常德市',
        'shortName': '常德',
        'code': '07',
        'lat': 29.012148855180815,
        'lon': 111.65371813684197,
        'layer': 2
      },
      {
        'name': '张家界市',
        'shortName': '张家界',
        'code': '08',
        'lat': 29.124889353219793,
        'lon': 110.4816201569677,
        'layer': 2
      },
      {
        'name': '益阳市',
        'shortName': '益阳',
        'code': '09',
        'lat': 28.58808777988717,
        'lon': 112.36654664522563,
        'layer': 2
      },
      {
        'name': '郴州市',
        'shortName': '郴州',
        'code': '10',
        'lat': 25.782263975738925,
        'lon': 113.03770446779562,
        'layer': 2
      },
      {
        'name': '永州市',
        'shortName': '永州',
        'code': '11',
        'lat': 26.435971646759207,
        'lon': 111.61464768615666,
        'layer': 2
      },
      {
        'name': '怀化市',
        'shortName': '怀化',
        'code': '12',
        'lat': 27.557482901172786,
        'lon': 109.9869587958539,
        'layer': 2
      },
      {
        'name': '娄底市',
        'shortName': '娄底',
        'code': '13',
        'lat': 27.741073302349072,
        'lon': 111.99639635657,
        'layer': 2
      },
      {
        'name': '湘西土家族苗族自治州',
        'shortName': '湘西',
        'code': '31',
        'lat': 28.31795079367364,
        'lon': 109.74574580039429,
        'layer': 2
      }
    ]
  },
  {
    'name': '广东省',
    'shortName': '广东',
    'code': '44',
    'lat': 23.40800372902474,
    'lon': 113.3948175587587,
    'layer': 1,
    'subRegion': [
      {
        'name': '广州市',
        'shortName': '广州',
        'code': '01',
        'lat': 23.12004910207623,
        'lon': 113.30764967515182,
        'layer': 2
      },
      {
        'name': '韶关市',
        'shortName': '韶关',
        'code': '02',
        'lat': 24.80296031189189,
        'lon': 113.5944611074356,
        'layer': 2
      },
      {
        'name': '深圳市',
        'shortName': '深圳',
        'code': '03',
        'lat': 22.546053546205247,
        'lon': 114.0259736573215,
        'layer': 2
      },
      {
        'name': '珠海市',
        'shortName': '珠海',
        'code': '04',
        'lat': 22.25691464612574,
        'lon': 113.56244702618993,
        'layer': 2
      },
      {
        'name': '汕头市',
        'shortName': '汕头',
        'code': '05',
        'lat': 23.383908453269196,
        'lon': 116.72865028834109,
        'layer': 2
      },
      {
        'name': '佛山市',
        'shortName': '佛山',
        'code': '06',
        'lat': 23.035094840514382,
        'lon': 113.1340256353934,
        'layer': 2
      },
      {
        'name': '江门市',
        'shortName': '江门',
        'code': '07',
        'lat': 22.57511678345104,
        'lon': 113.07812534115365,
        'layer': 2
      },
      {
        'name': '湛江市',
        'shortName': '湛江',
        'code': '08',
        'lat': 21.257463103764316,
        'lon': 110.36506726285033,
        'layer': 2
      },
      {
        'name': '茂名市',
        'shortName': '茂名',
        'code': '09',
        'lat': 21.66822571882161,
        'lon': 110.93124533067585,
        'layer': 2
      },
      {
        'name': '肇庆市',
        'shortName': '肇庆',
        'code': '12',
        'lat': 23.078663282928925,
        'lon': 112.4796533699162,
        'layer': 2
      },
      {
        'name': '惠州市',
        'shortName': '惠州',
        'code': '13',
        'lat': 23.11353985240842,
        'lon': 114.41065807997101,
        'layer': 2
      },
      {
        'name': '梅州市',
        'shortName': '梅州',
        'code': '14',
        'lat': 24.30457060603053,
        'lon': 116.12640309836864,
        'layer': 2
      },
      {
        'name': '汕尾市',
        'shortName': '汕尾',
        'code': '15',
        'lat': 22.77873050016389,
        'lon': 115.3729242893998,
        'layer': 2
      },
      {
        'name': '河源市',
        'shortName': '河源',
        'code': '16',
        'lat': 23.757250850469006,
        'lon': 114.71372147587483,
        'layer': 2
      },
      {
        'name': '阳江市',
        'shortName': '阳江',
        'code': '17',
        'lat': 21.87151730451877,
        'lon': 111.97700975587391,
        'layer': 2
      },
      {
        'name': '清远市',
        'shortName': '清远',
        'code': '18',
        'lat': 23.698468550422163,
        'lon': 113.04077334890835,
        'layer': 2
      },
      {
        'name': '东莞市',
        'shortName': '东莞',
        'code': '19',
        'lat': 23.043023815368237,
        'lon': 113.76343399075655,
        'layer': 2
      },
      {
        'name': '中山市',
        'shortName': '中山',
        'code': '20',
        'lat': 22.545177514512996,
        'lon': 113.42206002079804,
        'layer': 2
      },
      {
        'name': '潮州市',
        'shortName': '潮州',
        'code': '51',
        'lat': 23.661811676516503,
        'lon': 116.63007599086392,
        'layer': 2
      },
      {
        'name': '揭阳市',
        'shortName': '揭阳',
        'code': '52',
        'lat': 23.547999466926136,
        'lon': 116.37950085538243,
        'layer': 2
      },
      {
        'name': '云浮市',
        'shortName': '云浮',
        'code': '53',
        'lat': 22.937975685537467,
        'lon': 112.05094595864539,
        'layer': 2
      }
    ]
  },
  {
    'name': '广西壮族自治区',
    'shortName': '广西',
    'code': '45',
    'lat': 23.552254688119405,
    'lon': 108.92427442705878,
    'layer': 1,
    'subRegion': [
      {
        'name': '南宁市',
        'shortName': '南宁',
        'code': '01',
        'lat': 22.80649293560261,
        'lon': 108.29723355586638,
        'layer': 2
      },
      {
        'name': '柳州市',
        'shortName': '柳州',
        'code': '02',
        'lat': 24.329053352467223,
        'lon': 109.42240181015114,
        'layer': 2
      },
      {
        'name': '桂林市',
        'shortName': '桂林',
        'code': '03',
        'lat': 25.262901245955238,
        'lon': 110.26092014748276,
        'layer': 2
      },
      {
        'name': '梧州市',
        'shortName': '梧州',
        'code': '04',
        'lat': 23.485394636734455,
        'lon': 111.30547195007331,
        'layer': 2
      },
      {
        'name': '北海市',
        'shortName': '北海',
        'code': '05',
        'lat': 21.472718235009687,
        'lon': 109.12262791919323,
        'layer': 2
      },
      {
        'name': '防城港市',
        'shortName': '防城港',
        'code': '06',
        'lat': 21.61739847047181,
        'lon': 108.35179115286083,
        'layer': 2
      },
      {
        'name': '钦州市',
        'shortName': '钦州',
        'code': '07',
        'lat': 21.973350465312727,
        'lon': 108.6387980564235,
        'layer': 2
      },
      {
        'name': '贵港市',
        'shortName': '贵港',
        'code': '08',
        'lat': 23.10337316440881,
        'lon': 109.61370755657885,
        'layer': 2
      },
      {
        'name': '玉林市',
        'shortName': '玉林',
        'code': '09',
        'lat': 22.643973608377276,
        'lon': 110.15167631614493,
        'layer': 2
      },
      {
        'name': '百色市',
        'shortName': '百色',
        'code': '10',
        'lat': 23.901512367910115,
        'lon': 106.63182140365117,
        'layer': 2
      },
      {
        'name': '贺州市',
        'shortName': '贺州',
        'code': '11',
        'lat': 24.41105354711281,
        'lon': 111.5525941788367,
        'layer': 2
      },
      {
        'name': '河池市',
        'shortName': '河池',
        'code': '12',
        'lat': 24.699520782873197,
        'lon': 108.06994770936778,
        'layer': 2
      },
      {
        'name': '来宾市',
        'shortName': '来宾',
        'code': '13',
        'lat': 23.741165926514817,
        'lon': 109.23181650474223,
        'layer': 2
      },
      {
        'name': '崇左市',
        'shortName': '崇左',
        'code': '14',
        'lat': 22.415455296546437,
        'lon': 107.35732203836824,
        'layer': 2
      }
    ]
  },
  {
    'name': '海南省',
    'shortName': '海南',
    'code': '46',
    'lat': 19.18050080126052,
    'lon': 109.73375548794272,
    'layer': 1,
    'subRegion': [
      {
        'name': '海口市',
        'shortName': '海口',
        'code': '01',
        'lat': 20.022071276952243,
        'lon': 110.3308018483363,
        'layer': 2
      },
      {
        'name': '三亚市',
        'shortName': '三亚',
        'code': '02',
        'lat': 18.257775914897483,
        'lon': 109.52277128135884,
        'layer': 2
      },
      {
        'name': '三沙市',
        'shortName': '三沙',
        'code': '03',
        'lat': 19.18050080126052,
        'lon': 109.73375548794272,
        'layer': 2
      },
      {
        'name': '五指山市',
        'shortName': '五指山',
        'code': '9001',
        'lat': 18.831305749013495,
        'lon': 109.51775006369164,
        'layer': 2
      },
      {
        'name': '琼海市',
        'shortName': '琼海',
        'code': '9002',
        'lat': 19.21483036861679,
        'lon': 110.41435935151284,
        'layer': 2
      },
      {
        'name': '儋州市',
        'shortName': '儋州',
        'code': '9003',
        'lat': 19.571153091617184,
        'lon': 109.41397313258484,
        'layer': 2
      },
      {
        'name': '文昌市',
        'shortName': '文昌',
        'code': '9005',
        'lat': 19.750947380144982,
        'lon': 110.78090944498922,
        'layer': 2
      },
      {
        'name': '万宁市',
        'shortName': '万宁',
        'code': '9006',
        'lat': 18.839885909176672,
        'lon': 110.29250485723853,
        'layer': 2
      },
      {
        'name': '东方市',
        'shortName': '东方',
        'code': '9007',
        'lat': 18.99816086121773,
        'lon': 108.85100963157022,
        'layer': 2
      },
      {
        'name': '定安县',
        'shortName': '定安',
        'code': '9021',
        'lat': 19.490991397859613,
        'lon': 110.32009006938362,
        'layer': 2
      },
      {
        'name': '屯昌县',
        'shortName': '屯昌',
        'code': '9022',
        'lat': 19.34774912785167,
        'lon': 110.06336404474365,
        'layer': 2
      },
      {
        'name': '澄迈县',
        'shortName': '澄迈',
        'code': '9023',
        'lat': 19.69313506957734,
        'lon': 109.99673620157073,
        'layer': 2
      },
      {
        'name': '临高县',
        'shortName': '临高',
        'code': '9024',
        'lat': 19.80592201240859,
        'lon': 109.72410152868146,
        'layer': 2
      },
      {
        'name': '白沙黎族自治县',
        'shortName': '白沙',
        'code': '9025',
        'lat': 19.216056142061746,
        'lon': 109.35858558291052,
        'layer': 2
      },
      {
        'name': '昌江黎族自治县',
        'shortName': '昌江',
        'code': '9026',
        'lat': 19.22248290095683,
        'lon': 109.01129968162805,
        'layer': 2
      },
      {
        'name': '乐东黎族自治县',
        'shortName': '乐东',
        'code': '9027',
        'lat': 18.658613560733617,
        'lon': 109.0626980126998,
        'layer': 2
      },
      {
        'name': '陵水黎族自治县',
        'shortName': '陵水',
        'code': '9028',
        'lat': 18.575984851565984,
        'lon': 109.9486607100433,
        'layer': 2
      },
      {
        'name': '保亭黎族苗族自治县',
        'shortName': '保亭',
        'code': '9029',
        'lat': 18.597592346266765,
        'lon': 109.65611337968579,
        'layer': 2
      },
      {
        'name': '琼中黎族苗族自治县',
        'shortName': '琼中',
        'code': '9030',
        'lat': 19.039771066968406,
        'lon': 109.86184857077389,
        'layer': 2
      }
    ]
  },
  {
    'name': '重庆市',
    'shortName': '重庆',
    'code': '50',
    'lat': 29.54460610888615,
    'lon': 106.53063501341296,
    'layer': 1,
    'subRegion': [
      {
        'name': '万州区',
        'shortName': '万州',
        'code': '0101',
        'lat': 30.71005418436643,
        'lon': 108.41343863669852,
        'layer': 2
      },
      {
        'name': '涪陵区',
        'shortName': '涪陵',
        'code': '0102',
        'lat': 29.66467054055969,
        'lon': 107.34079973802694,
        'layer': 2
      },
      {
        'name': '渝中区',
        'shortName': '渝中',
        'code': '0103',
        'lat': 29.55523619439504,
        'lon': 106.54696678482918,
        'layer': 2
      },
      {
        'name': '大渡口区',
        'shortName': '大渡口',
        'code': '0104',
        'lat': 29.424139786946267,
        'lon': 106.46532181464664,
        'layer': 2
      },
      {
        'name': '江北区',
        'shortName': '江北',
        'code': '0105',
        'lat': 29.61931774406401,
        'lon': 106.71361473094244,
        'layer': 2
      },
      {
        'name': '沙坪坝区',
        'shortName': '沙坪坝',
        'code': '0106',
        'lat': 29.63054813662879,
        'lon': 106.3748048926506,
        'layer': 2
      },
      {
        'name': '九龙坡区',
        'shortName': '九龙坡',
        'code': '0107',
        'lat': 29.43456615495819,
        'lon': 106.37059488439483,
        'layer': 2
      },
      {
        'name': '南岸区',
        'shortName': '南岸',
        'code': '0108',
        'lat': 29.541514618902507,
        'lon': 106.66717849903546,
        'layer': 2
      },
      {
        'name': '北碚区',
        'shortName': '北碚',
        'code': '0109',
        'lat': 29.866596066865153,
        'lon': 106.52034245432448,
        'layer': 2
      },
      {
        'name': '綦江区',
        'shortName': '綦江',
        'code': '0110',
        'lat': 28.876139835279698,
        'lon': 106.67923744596435,
        'layer': 2
      },
      {
        'name': '大足区',
        'shortName': '大足',
        'code': '0111',
        'lat': 29.66070851836783,
        'lon': 105.74762640461321,
        'layer': 2
      },
      {
        'name': '渝北区',
        'shortName': '渝北',
        'code': '0112',
        'lat': 29.816264082426493,
        'lon': 106.75379853119536,
        'layer': 2
      },
      {
        'name': '巴南区',
        'shortName': '巴南',
        'code': '0113',
        'lat': 29.378027968889498,
        'lon': 106.75827415920337,
        'layer': 2
      },
      {
        'name': '黔江区',
        'shortName': '黔江',
        'code': '0114',
        'lat': 29.44098103358439,
        'lon': 108.71480796401747,
        'layer': 2
      },
      {
        'name': '长寿区',
        'shortName': '长寿',
        'code': '0115',
        'lat': 29.960491355030268,
        'lon': 107.1466153713222,
        'layer': 2
      },
      {
        'name': '江津区',
        'shortName': '江津',
        'code': '0116',
        'lat': 29.035351190668283,
        'lon': 106.2692818563863,
        'layer': 2
      },
      {
        'name': '合川区',
        'shortName': '合川',
        'code': '0117',
        'lat': 30.11870826013412,
        'lon': 106.31802875449188,
        'layer': 2
      },
      {
        'name': '永川区',
        'shortName': '永川',
        'code': '0118',
        'lat': 29.29648764699071,
        'lon': 105.88035760367573,
        'layer': 2
      },
      {
        'name': '南川区',
        'shortName': '南川',
        'code': '0119',
        'lat': 29.141685769527246,
        'lon': 107.17788827954455,
        'layer': 2
      },
      {
        'name': '潼南县',
        'shortName': '潼南',
        'code': '0223',
        'lat': 30.149932965958484,
        'lon': 105.81967884516254,
        'layer': 2
      },
      {
        'name': '铜梁县',
        'shortName': '铜梁',
        'code': '0224',
        'lat': 29.818322825123428,
        'lon': 106.03924293978721,
        'layer': 2
      },
      {
        'name': '荣昌县',
        'shortName': '荣昌',
        'code': '0226',
        'lat': 29.471195885653362,
        'lon': 105.51265645524255,
        'layer': 2
      },
      {
        'name': '璧山县',
        'shortName': '璧山',
        'code': '0227',
        'lat': 29.567501509061557,
        'lon': 106.19872658519758,
        'layer': 2
      },
      {
        'name': '梁平县',
        'shortName': '梁平',
        'code': '0228',
        'lat': 30.66436343528977,
        'lon': 107.72542817192878,
        'layer': 2
      },
      {
        'name': '城口县',
        'shortName': '城口',
        'code': '0229',
        'lat': 31.888131392208944,
        'lon': 108.74185516517073,
        'layer': 2
      },
      {
        'name': '丰都县',
        'shortName': '丰都',
        'code': '0230',
        'lat': 29.890595717682068,
        'lon': 107.8375173642987,
        'layer': 2
      },
      {
        'name': '垫江县',
        'shortName': '垫江',
        'code': '0231',
        'lat': 30.259498445887477,
        'lon': 107.44444454166096,
        'layer': 2
      },
      {
        'name': '武隆县',
        'shortName': '武隆',
        'code': '0232',
        'lat': 29.37927096359929,
        'lon': 107.71610570338773,
        'layer': 2
      },
      {
        'name': '忠县',
        'shortName': '忠县',
        'code': '0233',
        'lat': 30.34200325837365,
        'lon': 107.92173814089661,
        'layer': 2
      },
      {
        'name': '开县',
        'shortName': '开县',
        'code': '0234',
        'lat': 31.27710066076536,
        'lon': 108.38926046638842,
        'layer': 2
      },
      {
        'name': '云阳县',
        'shortName': '云阳',
        'code': '0235',
        'lat': 31.042409267236796,
        'lon': 108.86318575675075,
        'layer': 2
      },
      {
        'name': '奉节县',
        'shortName': '奉节',
        'code': '0236',
        'lat': 30.958552797155733,
        'lon': 109.35566670167509,
        'layer': 2
      },
      {
        'name': '巫山县',
        'shortName': '巫山',
        'code': '0237',
        'lat': 31.1211517202683,
        'lon': 109.90861122268106,
        'layer': 2
      },
      {
        'name': '巫溪县',
        'shortName': '巫溪',
        'code': '0238',
        'lat': 31.509161376320854,
        'lon': 109.36053147066296,
        'layer': 2
      },
      {
        'name': '石柱土家族自治县',
        'shortName': '石柱',
        'code': '0240',
        'lat': 30.09963694415459,
        'lon': 108.3048904279275,
        'layer': 2
      },
      {
        'name': '秀山土家族苗族自治县',
        'shortName': '秀山',
        'code': '0241',
        'lat': 28.498315398405296,
        'lon': 109.02532125367753,
        'layer': 2
      },
      {
        'name': '酉阳土家族苗族自治县',
        'shortName': '酉阳',
        'code': '0242',
        'lat': 28.90527766239135,
        'lon': 108.80680823732504,
        'layer': 2
      },
      {
        'name': '彭水苗族土家族自治县',
        'shortName': '彭水',
        'code': '0243',
        'lat': 29.359628264893676,
        'lon': 108.27286773419205,
        'layer': 2
      }
    ]
  },
  {
    'name': '四川省',
    'shortName': '四川',
    'code': '51',
    'lat': 30.36748093795755,
    'lon': 102.89915972360397,
    'layer': 1,
    'subRegion': [
      {
        'name': '成都市',
        'shortName': '成都',
        'code': '01',
        'lat': 30.679942845419564,
        'lon': 104.06792346330406,
        'layer': 2
      },
      {
        'name': '自贡市',
        'shortName': '自贡',
        'code': '03',
        'lat': 29.359156889475667,
        'lon': 104.77607133936438,
        'layer': 2
      },
      {
        'name': '攀枝花市',
        'shortName': '攀枝花',
        'code': '04',
        'lat': 26.587571257108653,
        'lon': 101.72242315249032,
        'layer': 2
      },
      {
        'name': '泸州市',
        'shortName': '泸州',
        'code': '05',
        'lat': 28.895929803860103,
        'lon': 105.44397028920636,
        'layer': 2
      },
      {
        'name': '德阳市',
        'shortName': '德阳',
        'code': '06',
        'lat': 31.131139652701417,
        'lon': 104.40239781824484,
        'layer': 2
      },
      {
        'name': '绵阳市',
        'shortName': '绵阳',
        'code': '07',
        'lat': 31.50470125806144,
        'lon': 104.70551897529307,
        'layer': 2
      },
      {
        'name': '广元市',
        'shortName': '广元',
        'code': '08',
        'lat': 32.441040158428244,
        'lon': 105.81968693999652,
        'layer': 2
      },
      {
        'name': '遂宁市',
        'shortName': '遂宁',
        'code': '09',
        'lat': 30.55749135037996,
        'lon': 105.56488779226322,
        'layer': 2
      },
      {
        'name': '内江市',
        'shortName': '内江',
        'code': '10',
        'lat': 29.599461534774647,
        'lon': 105.07305599171474,
        'layer': 2
      },
      {
        'name': '乐山市',
        'shortName': '乐山',
        'code': '11',
        'lat': 29.600957611095073,
        'lon': 103.76082423877176,
        'layer': 2
      },
      {
        'name': '南充市',
        'shortName': '南充',
        'code': '13',
        'lat': 30.800965168237234,
        'lon': 106.10555398379239,
        'layer': 2
      },
      {
        'name': '眉山市',
        'shortName': '眉山',
        'code': '14',
        'lat': 30.06111507994454,
        'lon': 103.84142956286796,
        'layer': 2
      },
      {
        'name': '宜宾市',
        'shortName': '宜宾',
        'code': '15',
        'lat': 28.76967479626591,
        'lon': 104.63301906152529,
        'layer': 2
      },
      {
        'name': '广安市',
        'shortName': '广安',
        'code': '16',
        'lat': 30.4639838878878,
        'lon': 106.63572033136818,
        'layer': 2
      },
      {
        'name': '达州市',
        'shortName': '达州',
        'code': '17',
        'lat': 31.214198858944734,
        'lon': 107.49497344658866,
        'layer': 2
      },
      {
        'name': '雅安市',
        'shortName': '雅安',
        'code': '18',
        'lat': 29.999716337065788,
        'lon': 103.00935646634746,
        'layer': 2
      },
      {
        'name': '巴中市',
        'shortName': '巴中',
        'code': '19',
        'lat': 31.869189159159983,
        'lon': 106.75791584175442,
        'layer': 2
      },
      {
        'name': '资阳市',
        'shortName': '资阳',
        'code': '20',
        'lat': 30.13219143395195,
        'lon': 104.63593030167381,
        'layer': 2
      },
      {
        'name': '阿坝藏族羌族自治州',
        'shortName': '阿坝',
        'code': '32',
        'lat': 31.90576285833887,
        'lon': 102.22856468921427,
        'layer': 2
      },
      {
        'name': '甘孜藏族自治州',
        'shortName': '甘孜',
        'code': '33',
        'lat': 30.055144114355528,
        'lon': 101.96923206306379,
        'layer': 2
      },
      {
        'name': '凉山彝族自治州',
        'shortName': '凉山',
        'code': '34',
        'lat': 27.89239290366571,
        'lon': 102.25959080320287,
        'layer': 2
      }
    ]
  },
  {
    'name': '贵州省',
    'shortName': '贵州',
    'code': '52',
    'lat': 26.902825927796762,
    'lon': 106.7349961033045,
    'layer': 1,
    'subRegion': [
      {
        'name': '贵阳市',
        'shortName': '贵阳',
        'code': '01',
        'lat': 26.62990674144093,
        'lon': 106.7091770961758,
        'layer': 2
      },
      {
        'name': '六盘水市',
        'shortName': '六盘水',
        'code': '02',
        'lat': 26.59186606031868,
        'lon': 104.85208676006856,
        'layer': 2
      },
      {
        'name': '遵义市',
        'shortName': '遵义',
        'code': '03',
        'lat': 27.699961377076246,
        'lon': 106.93126031648453,
        'layer': 2
      },
      {
        'name': '安顺市',
        'shortName': '安顺',
        'code': '04',
        'lat': 26.228594577737493,
        'lon': 105.92826996575766,
        'layer': 2
      },
      {
        'name': '毕节市',
        'shortName': '毕节',
        'code': '05',
        'lat': 27.408562131330886,
        'lon': 105.33332337116845,
        'layer': 2
      },
      {
        'name': '铜仁市',
        'shortName': '铜仁',
        'code': '06',
        'lat': 27.674902690624183,
        'lon': 109.16855802826001,
        'layer': 2
      },
      {
        'name': '黔西南布依族苗族自治州',
        'shortName': '黔西南',
        'code': '23',
        'lat': 25.095148055926884,
        'lon': 104.9005577982516,
        'layer': 2
      },
      {
        'name': '黔东南苗族侗族自治州',
        'shortName': '黔东南',
        'code': '26',
        'lat': 26.583991766541615,
        'lon': 107.98535257274064,
        'layer': 2
      },
      {
        'name': '黔南布依族苗族自治州',
        'shortName': '黔南',
        'code': '27',
        'lat': 26.26453599744225,
        'lon': 107.52320511005807,
        'layer': 2
      }
    ]
  },
  {
    'name': '云南省',
    'shortName': '云南',
    'code': '53',
    'lat': 24.86421279548333,
    'lon': 101.59295163700766,
    'layer': 1,
    'subRegion': [
      {
        'name': '昆明市',
        'shortName': '昆明',
        'code': '01',
        'lat': 25.049153100453157,
        'lon': 102.71460113878045,
        'layer': 2
      },
      {
        'name': '曲靖市',
        'shortName': '曲靖',
        'code': '03',
        'lat': 25.520758142870502,
        'lon': 103.78253888802674,
        'layer': 2
      },
      {
        'name': '玉溪市',
        'shortName': '玉溪',
        'code': '04',
        'lat': 24.370447134438425,
        'lon': 102.54506789248256,
        'layer': 2
      },
      {
        'name': '保山市',
        'shortName': '保山',
        'code': '05',
        'lat': 25.120489196190352,
        'lon': 99.17799561327821,
        'layer': 2
      },
      {
        'name': '昭通市',
        'shortName': '昭通',
        'code': '06',
        'lat': 27.340632963635457,
        'lon': 103.72502065573349,
        'layer': 2
      },
      {
        'name': '丽江市',
        'shortName': '丽江',
        'code': '07',
        'lat': 26.875351089481363,
        'lon': 100.22962839887937,
        'layer': 2
      },
      {
        'name': '普洱市',
        'shortName': '普洱',
        'code': '08',
        'lat': 22.78877778014943,
        'lon': 100.98005773013449,
        'layer': 2
      },
      {
        'name': '临沧市',
        'shortName': '临沧',
        'code': '09',
        'lat': 23.887806103773013,
        'lon': 100.09261291372643,
        'layer': 2
      },
      {
        'name': '楚雄彝族自治州',
        'shortName': '楚雄',
        'code': '23',
        'lat': 25.0663556741861,
        'lon': 101.52938223914012,
        'layer': 2
      },
      {
        'name': '红河哈尼族彝族自治州',
        'shortName': '红河',
        'code': '25',
        'lat': 23.367717516498995,
        'lon': 103.3840647571592,
        'layer': 2
      },
      {
        'name': '文山壮族苗族自治州',
        'shortName': '文山',
        'code': '26',
        'lat': 23.374086850409796,
        'lon': 104.24629431757161,
        'layer': 2
      },
      {
        'name': '西双版纳傣族自治州',
        'shortName': '西双版纳',
        'code': '28',
        'lat': 22.00943300223615,
        'lon': 100.80303827521057,
        'layer': 2
      },
      {
        'name': '大理白族自治州',
        'shortName': '大理',
        'code': '29',
        'lat': 25.59689963942069,
        'lon': 100.22367478928341,
        'layer': 2
      },
      {
        'name': '德宏傣族景颇族自治州',
        'shortName': '德宏',
        'code': '31',
        'lat': 24.441239663007963,
        'lon': 98.58943428740686,
        'layer': 2
      },
      {
        'name': '怒江傈僳族自治州',
        'shortName': '怒江',
        'code': '33',
        'lat': 25.860676978165355,
        'lon': 98.85993204248207,
        'layer': 2
      },
      {
        'name': '迪庆藏族自治州',
        'shortName': '迪庆',
        'code': '34',
        'lat': 27.831029461167333,
        'lon': 99.7136815988831,
        'layer': 2
      }
    ]
  },
  {
    'name': '西藏自治区',
    'shortName': '西藏',
    'code': '54',
    'lat': 31.36731540271471,
    'lon': 89.1379816840313,
    'layer': 1,
    'subRegion': [
      {
        'name': '拉萨市',
        'shortName': '拉萨',
        'code': '01',
        'lat': 29.662557062056536,
        'lon': 91.11189089598402,
        'layer': 2
      },
      {
        'name': '昌都地区',
        'shortName': '昌都',
        'code': '21',
        'lat': 31.140575631882083,
        'lon': 97.1855815799761,
        'layer': 2
      },
      {
        'name': '山南地区',
        'shortName': '山南',
        'code': '22',
        'lat': 29.229026931718007,
        'lon': 91.75064387441162,
        'layer': 2
      },
      {
        'name': '日喀则地区',
        'shortName': '日喀则',
        'code': '23',
        'lat': 29.26816003265482,
        'lon': 88.95606277351817,
        'layer': 2
      },
      {
        'name': '那曲地区',
        'shortName': '那曲',
        'code': '24',
        'lat': 31.480679830119627,
        'lon': 92.06701836885875,
        'layer': 2
      },
      {
        'name': '阿里地区',
        'shortName': '阿里',
        'code': '25',
        'lat': 30.404556588325356,
        'lon': 81.10766868948997,
        'layer': 2
      },
      {
        'name': '林芝地区',
        'shortName': '林芝',
        'code': '26',
        'lat': 29.666940625813243,
        'lon': 94.34998545824439,
        'layer': 2
      }
    ]
  },
  {
    'name': '陕西省',
    'shortName': '陕西',
    'code': '61',
    'lat': 35.860026261322766,
    'lon': 109.50378929072508,
    'layer': 1,
    'subRegion': [
      {
        'name': '西安市',
        'shortName': '西安',
        'code': '01',
        'lat': 34.277799897830626,
        'lon': 108.95309827919623,
        'layer': 2
      },
      {
        'name': '铜川市',
        'shortName': '铜川',
        'code': '02',
        'lat': 34.90836769638356,
        'lon': 108.96806701340064,
        'layer': 2
      },
      {
        'name': '宝鸡市',
        'shortName': '宝鸡',
        'code': '03',
        'lat': 34.36408080974784,
        'lon': 107.17064545238307,
        'layer': 2
      },
      {
        'name': '咸阳市',
        'shortName': '咸阳',
        'code': '04',
        'lat': 34.34537299599856,
        'lon': 108.70750927819563,
        'layer': 2
      },
      {
        'name': '渭南市',
        'shortName': '渭南',
        'code': '05',
        'lat': 34.5023579758288,
        'lon': 109.48393269657977,
        'layer': 2
      },
      {
        'name': '延安市',
        'shortName': '延安',
        'code': '06',
        'lat': 36.60332035226031,
        'lon': 109.50050975696925,
        'layer': 2
      },
      {
        'name': '汉中市',
        'shortName': '汉中',
        'code': '07',
        'lat': 33.08156897815767,
        'lon': 107.04547762872542,
        'layer': 2
      },
      {
        'name': '榆林市',
        'shortName': '榆林',
        'code': '08',
        'lat': 38.279439240070595,
        'lon': 109.74592574432862,
        'layer': 2
      },
      {
        'name': '安康市',
        'shortName': '安康',
        'code': '09',
        'lat': 32.70437044999437,
        'lon': 109.03804456347515,
        'layer': 2
      },
      {
        'name': '商洛市',
        'shortName': '商洛',
        'code': '10',
        'lat': 33.87390739508516,
        'lon': 109.93420815379513,
        'layer': 2
      }
    ]
  },
  {
    'name': '甘肃省',
    'shortName': '甘肃',
    'code': '62',
    'lat': 38.10326734375233,
    'lon': 102.45762459933961,
    'layer': 1,
    'subRegion': [
      {
        'name': '兰州市',
        'shortName': '兰州',
        'code': '01',
        'lat': 36.06422552504259,
        'lon': 103.8233054407292,
        'layer': 2
      },
      {
        'name': '嘉峪关市',
        'shortName': '嘉峪关',
        'code': '02',
        'lat': 39.80239732673353,
        'lon': 98.281634585257,
        'layer': 2
      },
      {
        'name': '金昌市',
        'shortName': '金昌',
        'code': '03',
        'lat': 38.51607179953174,
        'lon': 102.20812626259014,
        'layer': 2
      },
      {
        'name': '白银市',
        'shortName': '白银',
        'code': '04',
        'lat': 36.54668170616305,
        'lon': 104.171240903737,
        'layer': 2
      },
      {
        'name': '天水市',
        'shortName': '天水',
        'code': '05',
        'lat': 34.58431941886869,
        'lon': 105.73693162285642,
        'layer': 2
      },
      {
        'name': '武威市',
        'shortName': '武威',
        'code': '06',
        'lat': 37.933172142905626,
        'lon': 102.64014734336779,
        'layer': 2
      },
      {
        'name': '张掖市',
        'shortName': '张掖',
        'code': '07',
        'lat': 38.93932029698206,
        'lon': 100.45989186892419,
        'layer': 2
      },
      {
        'name': '平凉市',
        'shortName': '平凉',
        'code': '08',
        'lat': 35.550110190016646,
        'lon': 106.68891115654719,
        'layer': 2
      },
      {
        'name': '酒泉市',
        'shortName': '酒泉',
        'code': '09',
        'lat': 39.74147376815896,
        'lon': 98.50841450616744,
        'layer': 2
      },
      {
        'name': '庆阳市',
        'shortName': '庆阳',
        'code': '10',
        'lat': 35.72680075452996,
        'lon': 107.6442270867326,
        'layer': 2
      },
      {
        'name': '定西市',
        'shortName': '定西',
        'code': '11',
        'lat': 35.586056241828416,
        'lon': 104.62663760066474,
        'layer': 2
      },
      {
        'name': '陇南市',
        'shortName': '陇南',
        'code': '12',
        'lat': 33.39447997293795,
        'lon': 104.9345734057548,
        'layer': 2
      },
      {
        'name': '临夏回族自治州',
        'shortName': '临夏',
        'code': '29',
        'lat': 35.59851434880198,
        'lon': 103.21524917831645,
        'layer': 2
      },
      {
        'name': '甘南藏族自治州',
        'shortName': '甘南',
        'code': '30',
        'lat': 34.99221117837858,
        'lon': 102.9174424864958,
        'layer': 2
      }
    ]
  },
  {
    'name': '青海省',
    'shortName': '青海',
    'code': '63',
    'lat': 35.499761004274674,
    'lon': 96.20254367226111,
    'layer': 1,
    'subRegion': [
      {
        'name': '西宁市',
        'shortName': '西宁',
        'code': '01',
        'lat': 36.640738611957964,
        'lon': 101.76792098980276,
        'layer': 2
      },
      {
        'name': '海东市',
        'shortName': '海东',
        'code': '02',
        'lat': 36.51761016768607,
        'lon': 102.08520698745453,
        'layer': 2
      },
      {
        'name': '海北藏族自治州',
        'shortName': '海北',
        'code': '22',
        'lat': 36.96065410108381,
        'lon': 100.8798021744774,
        'layer': 2
      },
      {
        'name': '黄南藏族自治州',
        'shortName': '黄南',
        'code': '23',
        'lat': 35.52285155172832,
        'lon': 102.00760030834485,
        'layer': 2
      },
      {
        'name': '海南藏族自治州',
        'shortName': '海南',
        'code': '25',
        'lat': 36.284363803805,
        'lon': 100.6240660940972,
        'layer': 2
      },
      {
        'name': '果洛藏族自治州',
        'shortName': '果洛',
        'code': '26',
        'lat': 34.48048458460962,
        'lon': 100.22372276899289,
        'layer': 2
      },
      {
        'name': '玉树藏族自治州',
        'shortName': '玉树',
        'code': '27',
        'lat': 33.00623990972234,
        'lon': 97.01331613741361,
        'layer': 2
      },
      {
        'name': '海西蒙古族藏族自治州',
        'shortName': '海西',
        'code': '28',
        'lat': 37.373799070589904,
        'lon': 97.34262541533312,
        'layer': 2
      }
    ]
  },
  {
    'name': '宁夏回族自治区',
    'shortName': '宁夏',
    'code': '64',
    'lat': 37.32132311229541,
    'lon': 106.15548126505365,
    'layer': 1,
    'subRegion': [
      {
        'name': '银川市',
        'shortName': '银川',
        'code': '01',
        'lat': 38.50262101187604,
        'lon': 106.2064786078384,
        'layer': 2
      },
      {
        'name': '石嘴山市',
        'shortName': '石嘴山',
        'code': '02',
        'lat': 39.02022328360303,
        'lon': 106.37933720152914,
        'layer': 2
      },
      {
        'name': '吴忠市',
        'shortName': '吴忠',
        'code': '03',
        'lat': 37.99356100293566,
        'lon': 106.20825419850944,
        'layer': 2
      },
      {
        'name': '固原市',
        'shortName': '固原',
        'code': '04',
        'lat': 36.02152348070926,
        'lon': 106.28526799598252,
        'layer': 2
      },
      {
        'name': '中卫市',
        'shortName': '中卫',
        'code': '05',
        'lat': 37.52112419159455,
        'lon': 105.19675419935521,
        'layer': 2
      }
    ]
  },
  {
    'name': '新疆维吾尔自治区',
    'shortName': '新疆',
    'code': '65',
    'lat': 42.127000957642366,
    'lon': 85.61489933833856,
    'layer': 1,
    'subRegion': [
      {
        'name': '乌鲁木齐市',
        'shortName': '乌鲁木齐',
        'code': '01',
        'lat': 43.84038034721766,
        'lon': 87.56498774111579,
        'layer': 2
      },
      {
        'name': '克拉玛依市',
        'shortName': '克拉玛依',
        'code': '02',
        'lat': 45.59433106670623,
        'lon': 84.88118018614405,
        'layer': 2
      },
      {
        'name': '吐鲁番地区',
        'shortName': '吐鲁番',
        'code': '21',
        'lat': 42.96047001686681,
        'lon': 89.1815948656935,
        'layer': 2
      },
      {
        'name': '哈密地区',
        'shortName': '哈密',
        'code': '22',
        'lat': 42.8585963324445,
        'lon': 93.52835509281725,
        'layer': 2
      },
      {
        'name': '昌吉回族自治州',
        'shortName': '昌吉',
        'code': '23',
        'lat': 44.00705789853336,
        'lon': 87.29603812566712,
        'layer': 2
      },
      {
        'name': '博尔塔拉蒙古自治州',
        'shortName': '博尔塔拉蒙古',
        'code': '27',
        'lat': 44.9136513742982,
        'lon': 82.05243626722446,
        'layer': 2
      },
      {
        'name': '巴音郭楞蒙古自治州',
        'shortName': '巴音郭楞蒙古',
        'code': '28',
        'lat': 41.77136220256882,
        'lon': 86.1216883629838,
        'layer': 2
      },
      {
        'name': '阿克苏地区',
        'shortName': '阿克苏',
        'code': '29',
        'lat': 41.171730901451795,
        'lon': 80.2698461793294,
        'layer': 2
      },
      {
        'name': '克孜勒苏柯尔克孜自治州',
        'shortName': '克孜勒苏',
        'code': '30',
        'lat': 39.750345577845096,
        'lon': 76.13756447746248,
        'layer': 2
      },
      {
        'name': '喀什地区',
        'shortName': '喀什',
        'code': '31',
        'lat': 39.47062718874562,
        'lon': 75.99297326749168,
        'layer': 2
      },
      {
        'name': '和田地区',
        'shortName': '和田',
        'code': '32',
        'lat': 37.11677449267836,
        'lon': 79.93023863721294,
        'layer': 2
      },
      {
        'name': '伊犁哈萨克自治州',
        'shortName': '伊犁',
        'code': '40',
        'lat': 43.922248096340766,
        'lon': 81.29785353036553,
        'layer': 2
      },
      {
        'name': '塔城地区',
        'shortName': '塔城',
        'code': '42',
        'lat': 46.758683629680355,
        'lon': 82.9748805837443,
        'layer': 2
      },
      {
        'name': '阿勒泰地区',
        'shortName': '阿勒泰',
        'code': '43',
        'lat': 47.83974448619752,
        'lon': 88.13791548713202,
        'layer': 2
      },
      {
        'name': '石河子市',
        'shortName': '石河子',
        'code': '9001',
        'lat': 44.308258980430466,
        'lon': 86.04186492219485,
        'layer': 2
      },
      {
        'name': '阿拉尔市',
        'shortName': '阿拉尔',
        'code': '9002',
        'lat': 40.61568000518486,
        'lon': 81.2917365501579,
        'layer': 2
      },
      {
        'name': '图木舒克市',
        'shortName': '图木舒克',
        'code': '9003',
        'lat': 39.889222881804315,
        'lon': 79.19815510790364,
        'layer': 2
      },
      {
        'name': '五家渠市',
        'shortName': '五家渠',
        'code': '9004',
        'lat': 44.368899479017536,
        'lon': 87.56544898018092,
        'layer': 2
      }
    ]
  }
];
export default areraLanLon;
